# PANDAS

In [5]:
# IS A POWERFUL PACKAGE IN PYTHON

import numpy as np
import pandas as pd

In [6]:
a=pd.Series([3,4,5,6,7]) # SERIES--> COLLECTION OF VECTOR SERIES
a

0    3
1    4
2    5
3    6
4    7
dtype: int64

In [7]:
b=np.array([2,3,4,5])
b

array([2, 3, 4, 5])

In [8]:
c=pd.Series(b,index=['a','b','c','d'])
c

a    2
b    3
c    4
d    5
dtype: int32

In [10]:
dict={1:'hhh',2:'iii',3:'uuu'}
dict

{1: 'hhh', 2: 'iii', 3: 'uuu'}

In [11]:
c=pd.Series(dict)
c

1    hhh
2    iii
3    uuu
dtype: object

In [12]:
c[1]

'hhh'

# dataframe

In [19]:
c=pd.DataFrame([8,9,0])
c

   0
0  8
1  9
2  0

In [20]:
d={"name":['vv','nn','gg','ss'],"regno":[3,4,5,8],"rank":[6,7,8,9]}
pd.DataFrame(d)

  name  regno  rank
0   vv      3     6
1   nn      4     7
2   gg      5     8
3   ss      8     9

In [21]:
x=pd.read_csv("C:/Users/HP/Desktop/first year/FDS BOOK AND PPT/flower.csv")
x

    Sepal.Length    Sepal.Width       Species
0             5.3            3.7       setosa
1             5.1            3.8       setosa
2             7.2            3.0    virginica
3             5.4            3.4       setosa
4             5.1            3.3       setosa
5             5.4            3.9       setosa
6             7.4            2.8    virginica
7             6.1            2.8   versicolor
8             7.3            2.9   virginica
9             6.0            2.7   versicolor
10            5.8            2.8    virginica
11            6.3            2.3   versicolor
12            5.1            2.5   versicolor
13            6.3            2.5   versicolor
14            5.5            2.4   versicolor
15            5.2            3.1          x

In [22]:
x.loc[15]

Sepal.Length       5.2
 Sepal.Width       3.1
 Species          x
Name: 15, dtype: object

In [23]:
x.loc[0]

Sepal.Length          5.3
 Sepal.Width          3.7
 Species          setosa
Name: 0, dtype: object

In [25]:
x.loc[8]

Sepal.Length              7.3
 Sepal.Width              2.9
 Species          virginica
Name: 8, dtype: object

# 6/6/2023

In [1]:
# series:
import pandas as pd
import numpy as np

In [6]:
lab=['a','b','c']
m=[10,20,30]
arr=np.array([10,20,30])
d={'a':10,'b':20,'c':30}
print(d)
pd.Series(data=m)

{'a': 10, 'b': 20, 'c': 30}

0    10
1    20
2    30
dtype: int64

In [8]:
d = {'a': 1, 'b': 2, 'c': 3}
ser = pd.Series(data=d, index=['a', 'b', 'c'])
ser

a    1
b    2
c    3
dtype: int64

In [9]:
d = {'a': 1, 'b': 2, 'c': 3}
ser = pd.Series(data=d)
ser

a    1
b    2
c    3
dtype: int64

In [15]:
d = ['anu','vi']
pd.Series(data=d)

0    anu
1     vi
dtype: object

In [17]:
d = {'a': 1, 'b': 2, 'c': 3}
pd.Series(data=d, index=['x', 'y', 'z'])#values varathu bzc already oru index eruku so create one

x   NaN
y   NaN
z   NaN
dtype: float64

In [29]:
d = {'a': 1, 'b': 2, 'c': 3}
s=[2,3,4]
g=pd.Series(data=s, index=['x', 'y', 'z'])
g

x    2
y    3
z    4
dtype: int64

In [30]:
g[2]#-->slicind in pandas

4

In [33]:
d = {'a': 1, 'b': 2, 'c': 3}
s=[2,3,4]
f=['vv','gg','nn']
pd.Series(data=s,index=(f[0:3]))

vv    2
gg    3
nn    4
dtype: int64

In [35]:
r = [1, 2]
ser = pd.Series(r, copy=False)
ser.iloc[0] = 999
print(r)
ser

[1, 2]

0    999
1      2
dtype: int64

In [38]:
pd.Series([sum,print])

0      <built-in function sum>
1    <built-in function print>
dtype: object

In [41]:
m=pd.Series([20,20,30],index=['us','we','they'])
m

us      20
we      20
they    30
dtype: int64

In [43]:
m['we']

20

In [44]:
m[0]# indexing 0 oda value we so namba 0 or we pota athoda value varum

20

In [46]:
m1=pd.Series([20,60,30],index=['us','we','there'])
m1

us       20
we       60
there    30
dtype: int64

In [48]:
C=m+m1 # there la eruku but add agathu bcz namba m la there illa but we eruku athado value 20 then m1 la we eruka adhado value 20 add agi return pannum
D=m-m1
print(C)
print(D)

there     NaN
they      NaN
us       40.0
we       80.0
dtype: float64

there     NaN
they      NaN
us        0.0
we      -40.0
dtype: float64

# DATAFRAMES

In [66]:
import numpy as np
a=[1,2,3,4]
y=['a','b','c','d']
f=['u']
df=pd.DataFrame(data=a,index=(y),columns = f)
df

   u
a  1
b  2
c  3
d  4

In [67]:
d = {'col1': [1, 2], 'col2': [3, 4]}
df = pd.DataFrame(data=d)
df

   col1  col2
0     1     3
1     2     4

# 9/5/23

In [1]:
import numpy as np
import pandas as pd

In [4]:
arr=[[4,3,3],[3,5,3],[2,3,4]]
c=pd.Series(arr)
c

0    [4, 3, 3]
1    [3, 5, 3]
2    [2, 3, 4]
dtype: object

In [5]:
arr[2]

[2, 3, 4]

In [6]:
arr[2][1]

3

In [13]:
arr=[[[2,3,4],[3,4,5]],[[3,4,5],[3,45,5]]]
f=['num1','num2']
pd.DataFrame(data=arr,columns=f)

        num1        num2
0  [2, 3, 4]   [3, 4, 5]
1  [3, 4, 5]  [3, 45, 5]

In [42]:
df=[['a','e','r','t','y'],['a','e','u','p','o'],['t','i','w','p','o'],['a','e','v','b','m']]
ls=[1,2,3,4,5]
col=['n1','n2','n3','n4']
df=pd.DataFrame(data=df,index=(col),columns=ls)
df

    1  2  3  4  5
n1  a  e  r  t  y
n2  a  e  u  p  o
n3  t  i  w  p  o
n4  a  e  v  b  m

In [38]:
df[1]

['a', 'e', 'u', 'p', 'o']

In [41]:
df[1][2]

'u'

In [55]:
df[ls[2]][2]

'w'

In [57]:
df[ls[[2][0]]]

n1    r
n2    u
n3    w
n4    v
Name: 3, dtype: object

In [59]:
df.drop(5,axis=1)#---->to delete the column

    1  2  3  4
n1  a  e  r  t
n2  a  e  u  p
n3  t  i  w  p
n4  a  e  v  b

In [61]:
df.drop('n2',axis=0)

    1  2  3  4  5
n1  a  e  r  t  y
n3  t  i  w  p  o
n4  a  e  v  b  m

In [75]:
n1=[2,3,4,5,5]
n2=[4,5,6,6,7]
n3=[3,4,5,7,8]
col=['m1','m2','m3','m4','m5']
ls=[1,2,3]
o=pd.DataFrame(data=(n1,n2,n3),index=(ls),columns=col)
o

   m1  m2  m3  m4  m5
1   2   3   4   5   5
2   4   5   6   6   7
3   3   4   5   7   8

In [79]:
o['m1+m2'] = o['m1']+o['m2']
o

   m1  m2  m3  m4  m5  m1+m2
1   2   3   4   5   5      5
2   4   5   6   6   7      9
3   3   4   5   7   8      7

In [ ]:
df.loc()

In [82]:
o['m1*m2'] = o['m1']*o['m2']
o

   m1  m2  m3  m4  m5  m1+m2  m1*m2
1   2   3   4   5   5      5      6
2   4   5   6   6   7      9     20
3   3   4   5   7   8      7     12

In [83]:
o['m1/m2'] = o['m1']/o['m2']
o

   m1  m2  m3  m4  m5  m1+m2  m1*m2     m1/m2
1   2   3   4   5   5      5      6  0.666667
2   4   5   6   6   7      9     20  0.800000
3   3   4   5   7   8      7     12  0.750000

In [84]:
o['m1-m2'] = o['m1']-o['m2']
o

   m1  m2  m3  m4  m5  m1+m2  m1*m2     m1/m2  m1-m2
1   2   3   4   5   5      5      6  0.666667     -1
2   4   5   6   6   7      9     20  0.800000     -1
3   3   4   5   7   8      7     12  0.750000     -1

In [1]:
dict={'a':2,'b':4,'f':5,'y':'apple'}

# MISSING DATA

In [2]:
import numpy as np
import pandas as pd

In [3]:
df=pd.DataFrame({'a':[1,2,np.nan,4],'b':[2,3,3,3], 'c':[8,np.nan,np.nan,3]}) ##-->nan not a num
df

     a  b    c
0  1.0  2  8.0
1  2.0  3  NaN
2  NaN  3  NaN
3  4.0  3  3.0

# REMOVING MISSING DATA

In [4]:
df.dropna(axis=0)  ##axis=0 row

     a  b    c
0  1.0  2  8.0
3  4.0  3  3.0

In [5]:
a=df.dropna(axis=1) ##axis=1 column
print(a)
type(a)

   b
0  2
1  3
2  3
3  3

pandas.core.frame.DataFrame

# THRESHOLD

In [6]:
df.dropna(thresh=2)##-->2 and above rows print pannum and nan values are reserved

     a  b    c
0  1.0  2  8.0
1  2.0  3  NaN
3  4.0  3  3.0

# FILLING MISSING DATA

In [7]:
df.fillna(value=2)

     a  b    c
0  1.0  2  8.0
1  2.0  3  2.0
2  2.0  3  2.0
3  4.0  3  3.0

In [8]:
df['a'].fillna(value=7)# particular col ku mattum fill pannrathuku

0    1.0
1    2.0
2    7.0
3    4.0
Name: a, dtype: float64

In [9]:
df['a'].fillna(df['a'].mean())

0    1.000000
1    2.000000
2    2.333333
3    4.000000
Name: a, dtype: float64

# group by

In [10]:
## it allows you to group rows of data 2gether and aggregate functions

df.head()

In [11]:
df.head()

     a  b    c
0  1.0  2  8.0
1  2.0  3  NaN
2  NaN  3  NaN
3  4.0  3  3.0

In [12]:
df.describe()

              a     b         c
count  3.000000  4.00  2.000000
mean   2.333333  2.75  5.500000
std    1.527525  0.50  3.535534
min    1.000000  2.00  3.000000
25%    1.500000  2.75  4.250000
50%    2.000000  3.00  5.500000
75%    3.000000  3.00  6.750000
max    4.000000  3.00  8.000000

In [13]:
df.groupby('a').count()

     b  c
a
1.0  1  1
2.0  1  0
4.0  1  1

# OPERATIONS

In [45]:
import pandas as pd
d=[1,2,3,4,5,6,7]
df_one=pd.DataFrame({'aa':[11,123,111,22,33,44,44],
                    'col1':['aaa','abc','dd',22,44,66.33,66.33],
                     'bb':[2,3,4,5,6,7,8.2]},index=(d))
df_one

    aa   col1   bb
1   11    aaa  2.0
2  123    abc  3.0
3  111     dd  4.0
4   22     22  5.0
5   33     44  6.0
6   44  66.33  7.0
7   44  66.33  8.2

In [59]:
d=[1,2,3]
df_one1=pd.DataFrame({'student':['vv','yy','uu'],
                    'marks':[22,600,55],
                     'total':[240,600,92]},index=(d))
df_one1

  student  marks  total
1      vv     22    240
2      yy    600    600
3      uu     55     92

In [60]:
### unique values:

In [61]:
df_one['col1'].unique()

array(['aaa', 'abc', 'dd', 22, 44, 66.33], dtype=object)

In [62]:
df_one['aa'].nunique() ##-->how many no of uniques

6

In [63]:
df_one['col1'].value_counts() ##-->returns how many times repeated

66.33    2
aaa      1
abc      1
dd       1
22       1
44       1
Name: col1, dtype: int64

In [65]:
df_one.drop_duplicates()

    aa   col1   bb
1   11    aaa  2.0
2  123    abc  3.0
3  111     dd  4.0
4   22     22  5.0
5   33     44  6.0
6   44  66.33  7.0
7   44  66.33  8.2

In [67]:
df_one['new col']=df_one['col1']=10
df_one

    aa  col1   bb  new col
1   11    10  2.0       10
2  123    10  3.0       10
3  111    10  4.0       10
4   22    10  5.0       10
5   33    10  6.0       10
6   44    10  7.0       10
7   44    10  8.2       10

In [82]:
i=1
d=[1,2,3,4,5]
df_one3=pd.DataFrame({'student':['vv','yy','uu','tt','ty'],
                    'marks':[22,600,55,77,88],
                     'total':[240,600,92,55,4]},index=(d))
df_one3
while(i<5):
    df_one3['tot']=df_one3['total']=5
    i=i+1
df_one3

  student  marks  total  tot
1      vv     22      5    5
2      yy    600      5    5
3      uu     55      5    5
4      tt     77      5    5
5      ty     88      5    5

In [8]:
a=10
b=8 #-->b=5 na output 5 varuthu
try:
   
    c=a/b
except:
    print("not divisible")
finally:
     print(c)

1.25

In [5]:
## sorting and ordering in python
import pandas as pd

In [9]:
a=[1,2,3,4,5]
b=[['vv','yy','uu','ww','aa'],['aa','dd','ss','ss','rr'],[4,6,2,7,1]]
c=['name','location','years']

df=pd.DataFrame(data=b,index=a,columns=c)
df

ValueError: 3 columns passed, passed data had 5 columns

In [11]:
df=pd.DataFrame({'name':['vv','vh','uu','ii'],'empid':[7,8,4,5],'salary':[200,123,678,500]})
df

  name  empid  salary
0   vv      7     200
1   vh      8     123
2   uu      4     678
3   ii      5     500

In [14]:
df.sort_values([ 'empid']) ## to sort the table

  name  empid  salary
2   uu      4     678
3   ii      5     500
0   vv      7     200
1   vh      8     123

In [21]:
df1=pd.DataFrame({'a':[2,5,3,5],'b':[4,62,1,6],'c':[4,7,8,9]})
df1

   a   b  c
0  2   4  4
1  5  62  7
2  3   1  8
3  5   6  9

In [20]:
df2=pd.DataFrame({'a':[5,5,5,5],'b':[4,62,7,6],'c':[6,7,9,9]})
df2

   a   b  c
0  5   4  6
1  5  62  7
2  5   7  9
3  5   6  9

In [22]:
df1+df2

    a    b   c
0   7    8  10
1  10  124  14
2   8    8  17
3  10   12  18

In [24]:
dff=pd.concat([df1,df2])
dff

   a   b  c
0  2   4  4
1  5  62  7
2  3   1  8
3  5   6  9
0  5   4  6
1  5  62  7
2  5   7  9
3  5   6  9

In [25]:
dff=pd.cut
dff

AttributeError: module 'pandas' has no attribute 'append'